module.exports = {
  name: "/",
  description: "Send a random Islamic event message.",
  usage: "/ig",
  version: "1.0.0",
  execute: async (api, event, args) => {
    const messages = [
      "•—»✨「𝐀𝐌𝐈𝐍𝐔𝐋-𝐁𝐎𝐓 」✨«—•\n༆-✿Prefix Event ༊࿐\n╭•┄┅═══❁🌺❁═══┅┄•╮\n\n᭄࿐-ইচ্ছে!!!গুলো!!!যদি!!!পবিত্র!!হয়!✿᭄\n\n✿᭄তাহলে!!!স্বপ্ন!!! গুলো..🖤🥀\n\n✿᭄ ࿐- একদিন!!!পূরণ!!!হবেই!!! ✿᭄\n\n✿᭄࿐ইনশাআল্লাহ..🖤🥀\n\n╰•┄┅═══❁🌺❁═══┅┄•╯\n𝐂𝐑𝐄𝐀𝐓𝐄 𝐁𝐘: 𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿",
      "•—»✨「𝐀𝐌𝐈𝐍𝐔𝐋-𝐁𝐎𝐓 」✨«—•\n༆-✿Prefix Event ༊࿐ \n╭•┄┅═══❁🌺❁═══┅┄•╮\n\n_____✵♡︎\n\n___কি  হবে  এত  মানুষের প্রিয় হয়ে__🦋🌻\n\n__যদি আল্লাহ   প্রিয় না হতে পারি__🙂🦋\n\n_____✵♡︎\n\n╰•┄┅═══❁🌺❁═══┅┄•╯\n𝐂𝐑𝐄𝐀𝐓𝐄 𝐁𝐘: 𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿",
      "•—»✨「𝐀𝐌𝐈𝐍𝐔𝐋-𝐁𝐎𝐓 」  ✨«—•\n༆-✿Prefix Event ༊࿐\n╭•┄┅═══❁🌺❁═══┅┄•╮\n\n┏╮/╱╰️❥☆••\n╱/╰┛🍁࿐চিরস্থায়ী কি \nজানেন͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌༒࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n༄আপনার সুন্দর ব্যবহার!!🍁!!࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌\n\n࿐͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌͌🍁যেটা মৃত্যুর পরও সবার সৃতিতে থাকবে🥰❁ཻ͜͡ღ᭄\n\n╰•┄┅═══❁🌺❁═══┅┄•╯\n𝐂𝐑𝐄𝐀𝐓𝐄 𝐁𝐘: 𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿",
      "•—»✨「𝐀𝐌𝐈𝐍𝐔𝐋-𝐁𝐎𝐓 」  ✨«—•\n༆-✿Prefix Event ༊࿐\n╭•┄┅═══❁🌺❁═══┅┄•╮\n\n🦋\n\n-মক্কা তুমি ধন্য.༏༏😽🕋࿐\n\n-তোমার বুকে হয়েছিলো বিশ্ব নবীর জন্ম.༏༏࿐💛🙆\n\n🦋\n\n╰•┄┅═══❁🌺❁═══┅┄•╯\n𝐂𝐑𝐄𝐀𝐓𝐄 𝐁𝐘: 𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿",
      "•—»✨「𝐀𝐌𝐈𝐍𝐔𝐋-𝐁𝐎𝐓 」  ✨«—•\n༆-✿Prefix Event ༊࿐\n╭•┄┅═══❁🌺❁═══┅┄•╮\n\n●══❥𝄞⋆⃝🥰 ভাগ্যর ༅༎༅ উপর ༅༎༅ কারো ༅༎༅ হাত নেই !!💚🌺🥀\n\n────😕\n🦋🌺-༅༎༅ সব ༅ ༎༅ কিছু ༅༎༅ পরিবর্তন ლ🌼\n༅༎༅ করার  মালিক  🌻😽💖\n\n🕊༎༅ একমাত্র ༅༎༅ আল্লাহ \n\n╰•┄┅═══❁🌺❁═══┅┄•╯\n𝐂𝐑𝐄𝐀𝐓𝐄 𝐁𝐘: 𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿"
    ];

    // Random message selection
    const randomMessage = messages[Math.floor(Math.random() * messages.length)];

    // Send the message
    api.sendMessage(randomMessage, event.threadID);
  }
};
