module.exports = {
  name: "message2",
  async execute({ api, event }) {
    const { threadID, body } = event;
    const msg = body?.toLowerCase();
    if (!msg) return;

    const replies = {
      "🤔": "☹︎シ︎আমি ভাবি ই একটু আলাদা আর যা করি নিজের মন মতো করি  ಠ★\n\n\n\n༆কারোরমতো হওয়ার ইচ্ছা  আমার নাইシ︎\n\n\n\n☺︎︎কারন আমি নিজেই ব্যান্ড তোমার মতো আবাল না🤟\n\n𓂀 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀🤟💥",
      "🕵️‍♀️": "☹︎シ︎আমি ভাবি ই একটু আলাদা আর যা করি নিজের মন মতো করি  ಠ★\n\n\n\n༆কারোরমতো হওয়ার ইচ্ছা  আমার নাইシ︎\n\n\n\n☺︎︎কারন আমি নিজেই ব্যান্ড তোমার মতো আবাল না🤟\n\n𓂀 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀🤟💥",
      "😘": "কিস দিস না তোর মুখে দূর গন্ধ কয়দিন ধরে দাঁত ব্রাশ করিস নাই🤬",
      "😽": "কিস দিস না তোর মুখে দূর গন্ধ কয়দিন ধরে দাঁত ব্রাশ করিস নাই🤬",
      "👍": "সর এখান থেকে লাইকার আবাল..!🐸🤣👍⛏️",
     "hlw": "এত হাই-হ্যালো ..!🍆⛏️🐸🤣",
      "helo": "এত হাই-হ্যালো ..!🍆⛏️🐸🤣",
      "🎭": "༎🎭༅•─༅༅─•༅🎭༎\n\nচুলা জ্বালাইতে পারে না  একটা  ༎﹏ღ\n❌༅༎সম্পর্কে আগুন লাগাইতে।পারে༎❌\n\n༊_༎কিছু মাদারচোদ লোক🎭\n\n༎🎭༅•༅༅༎༅•༅🎭༎\n꧁✨☬̈́☆☆☆☬̈́✨꧂\n 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀😈",
      "👏": "༎🎭༅•─༅༅─•༅🎭༎\n\nচুলা জ্বালাইতে পারে না  একটা  ༎﹏ღ\n❌༅༎সম্পর্কে আগুন লাগাইতে।পারে༎❌\n\n༊_༎কিছু মাদারচোদ লোক🎭\n\n༎🎭༅•༅༅༎༅•༅🎭༎\n꧁✨☬̈́☆☆☆☬̈́✨꧂\n 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀😈",
      "✍️": "༎🎭༅•─༅༅─•༅🎭༎\n\n༊_༎ আগে আমি অনেক ভালো ছিলাম  \n\n﹏😌ღ\n\n༅༎﹏ আগে তবে এখন না 😈👿🎭\n\n༎🎭༅•༅༅༎༅•༅🎭༎\n𓂀 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀😈",
      "ami vlo": "༎🎭༅•─༅༅─•༅🎭༎\n\n༊_༎ আগে আমি অনেক ভালো ছিলাম  \n\n﹏😌ღ\n\n༅༎﹏ আগে তবে এখন না 😈👿🎭\n\n༎🎭༅•༅༅༎༅•༅🎭༎\n𓂀 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀😈",
      "kharap": "༎🎭༅•─༅༅─•༅🎭༎\n\n༊_༎ আগে আমি অনেক ভালো ছিলাম  \n\n﹏😌ღ\n\n༅༎﹏ আগে তবে এখন না 😈👿🎭\n\n༎🎭༅•༅༅༎༅•༅🎭༎\n𓂀 𝔸𝕞𝕚𝕟𝕦𝕝 𝕊𝕠𝕣𝕕𝕒𝕣 𓂀😈",
      "morning": "Hello dear, have a nice day ❤️",
      "anyone": "Main Hun Naw JaNyMan ❤️",
      "any": "Main Hun Naw JaNyMan ❤️",
      "aminul": "উনি এখন কাজে বিজি আছে যা বলার আমাকে বলতে পারেন😘",
      "aminul sordar": "উনি এখন কাজে বিজি আছে যা বলার আমাকে বলতে পারেন😘",
      "@aminul sordar": "উনি এখন কাজে বিজি আছে যা বলার আমাকে বলতে পারেন😘"
    };

    if (replies[msg]) {
      return api.sendMessage(replies[msg], threadID);
    }
  }
};
